xml/request2.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:sum="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/tikeV1.0/cont/ws/SuministroLR.xsd"
                  xmlns:sum1="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/tikeV1.0/cont/ws/SuministroInformacion.xsd"
                  xmlns:xd="http://www.w3.org/2000/09/xmldsig#">
  <soapenv:Header/>
  <soapenv:Body>
    <sum:RegFactuSistemaFacturacion>
      <sum:Cabecera>
        <sum1:ObligadoEmision>
          <sum1:NombreRazon>SOFTCRAFTER S.L.</sum1:NombreRazon>
          <sum1:NIF>B56803240</sum1:NIF>
        </sum1:ObligadoEmision>
      </sum:Cabecera>
      <sum:RegistroFactura>
        <sum1:RegistroAlta>
          <sum1:IDVersion>1.0</sum1:IDVersion>
          <sum1:IDFactura>
            <sum1:IDEmisorFactura>B56803240</sum1:IDEmisorFactura>
            <sum1:NumSerieFactura>FACT2024-011</sum1:NumSerieFactura>
            <sum1:FechaExpedicionFactura>25-06-2025</sum1:FechaExpedicionFactura>
          </sum1:IDFactura>
          <sum1:NombreRazonEmisor>SOFTCRAFTER S.L.</sum1:NombreRazonEmisor>
          <sum1:TipoFactura>F1</sum1:TipoFactura>
          <sum1:DescripcionOperacion>xxxxxxxxxxxxxxxxxxxxxxxxx</sum1:DescripcionOperacion>
          <sum1:Destinatarios>
            <sum1:IDDestinatario>
              <sum1:NombreRazon>MIDIAMADRID</sum1:NombreRazon>
              <sum1:NIF>B56803273</sum1:NIF>
            </sum1:IDDestinatario>
          </sum1:Destinatarios>
          <sum1:Desglose>
            <sum1:DetalleDesglose>
              <sum1:ClaveRegimen>01</sum1:ClaveRegimen>
              <sum1:CalificacionOperacion>S1</sum1:CalificacionOperacion>
              <sum1:TipoImpositivo>4</sum1:TipoImpositivo>
              <sum1:BaseImponibleOimporteNoSujeto>10</sum1:BaseImponibleOimporteNoSujeto>
              <sum1:CuotaRepercutida>0.4</sum1:CuotaRepercutida>
            </sum1:DetalleDesglose>
            <sum1:DetalleDesglose>
              <sum1:ClaveRegimen>01</sum1:ClaveRegimen>
              <sum1:CalificacionOperacion>S1</sum1:CalificacionOperacion>
              <sum1:TipoImpositivo>21</sum1:TipoImpositivo>
              <sum1:BaseImponibleOimporteNoSujeto>100</sum1:BaseImponibleOimporteNoSujeto>
              <sum1:CuotaRepercutida>21</sum1:CuotaRepercutida>
            </sum1:DetalleDesglose>
          </sum1:Desglose>
          <sum1:CuotaTotal>21.4</sum1:CuotaTotal>
          <sum1:ImporteTotal>131.4</sum1:ImporteTotal>
          <sum1:Encadenamiento>
            <sum1:RegistroAnterior>
              <PrimerRegistro>S</PrimerRegistro>
            </sum1:RegistroAnterior>
          </sum1:Encadenamiento>
          <sum1:SistemaInformatico>
            <sum1:NombreRazon>VERIFACTU JAVA CLIENT</sum1:NombreRazon>
            <sum1:NIF>B12959755</sum1:NIF>
            <sum1:NombreSistemaInformatico>VeriFactu-Java</sum1:NombreSistemaInformatico>
            <sum1:IdSistemaInformatico>upos</sum1:IdSistemaInformatico>
            <sum1:Version>1.0.0</sum1:Version>
            <sum1:TipoUsoPosibleSoloVerifactu>N</sum1:TipoUsoPosibleSoloVerifactu>
            <sum1:NumeroInstalacion>383</sum1:NumeroInstalacion>
            <sum1:TipoUsoPosibleMultiOT>S</sum1:TipoUsoPosibleMultiOT>
            <sum1:IndicadorMultiplesOT>S</sum1:IndicadorMultiplesOT>
          </sum1:SistemaInformatico>
          <sum1:FechaHoraHusoGenRegistro>2025-06-26T11:31:44+02:00</sum1:FechaHoraHusoGenRegistro>
          <sum1:TipoHuella>01</sum1:TipoHuella>
          <sum1:Huella>F2CC09124833B90BEE17384C9E52710D4C16B77F52535CEF42EB3CDDE0201A55</sum1:Huella>
        </sum1:RegistroAlta>
      </sum:RegistroFactura>
    </sum:RegFactuSistemaFacturacion>
  </soapenv:Body>
</soapenv:Envelope>